import { Request, Response } from 'express';

const data = [
  {
    id: 1,
    title: '小章发表了“请问专家小麦的生长期是多久？？”的问答，请注意查看~',
    time: "2020-02-10 12:30:30"
  },
  {
    id: 2,
    title: '小章发表了“请问专家小麦的生长期是多久？？”的问答，请注意查看~',
    time: "2020-02-10 12:30:30"
  },
  {
    id: 3,
    title: '小章发表了“请问专家小麦的生长期是多久？？”的问答，请注意查看~',
    time: "2020-02-10 12:30:30"
  },
  {
    id: 4,
    title: '小章发表了“请问专家小麦的生长期是多久？？”的问答，请注意查看~',
    time: "2020-02-10 12:30:30"
  },
  {
    id: 5,
    title: '小章发表了“请问专家小麦的生长期是多久？？”的问答，请注意查看~',
    time: "2020-02-10 12:30:30"
  },
  {
    id: 6,
    title: '小章发表了“请问专家小麦的生长期是多久？？”的问答，请注意查看~',
    time: "2020-02-10 12:30:30"
  },
  {
    id: 7,
    title: '小章发表了“请问专家小麦的生长期是多久？？”的问答，请注意查看~',
    time: "2020-02-10 12:30:30"
  },
  {
    id: 8,
    title: '小章发表了“请问专家小麦的生长期是多久？？”的问答，请注意查看~',
    time: "2020-02-10 12:30:30"
  },
  {
    id: 9,
    title: '小章发表了“请问专家小麦的生长期是多久？？”的问答，请注意查看~',
    time: "2020-02-10 12:30:30"
  },
  {
    id: 10,
    title: '小章发表了“请问专家小麦的生长期是多久？？”的问答，请注意查看~',
    time: "2020-02-10 12:30:30"
  },
  {
    id: 11,
    title: '小章发表了“请问专家小麦的生长期是多久？？”的问答，请注意查看~',
    time: "2020-02-10 12:30:30"
  },
  {
    id: 12,
    title: '小章发表了“请问专家小麦的生长期是多久？？”的问答，请注意查看~',
    time: "2020-02-10 12:30:30"
  },
];

export default {
 'POST /api/message/list': (req: Request, res: Response) => {
    res.send({
      error: 0,
      data: data,
      pagination: {
        item_total: 20,
        page: 1,
        page_count: 20,
        page_total: 1,
      }
    });
  },
};
